export type InstitutionHierarchy = {
  [university: string]: {
    [school: string]: string[];
  };
};

export const INSTITUTION_HIERARCHY: InstitutionHierarchy = {
  'Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών': {
    'Θετικών Επιστημών': ['Αεροδιαστημικής Επιστήμης και Τεχνολογίας', 'Βιολογίας', 'Γεωλογίας και Γεωπεριβάλλοντος', 'Ιστορίας και Φιλοσοφίας της Επιστήμης', 'Μαθηματικών', 'Πληροφορικής και Τηλεπικοινωνιών', 'Τεχνολογιών Ψηφιακής Βιομηχανίας', 'Φυσικής', 'Χημείας'],
    'Φιλοσοφική': ['Παιδαγωγικό Τμήμα Δευτεροβάθμιας Εκπαίδευσης', 'Αγγλικής Γλώσσας και Φιλολογίας', 'Γαλλικής Γλώσσας και Φιλολογίας', 'Γερμανικής Γλώσσας και Φιλολογίας', 'Θεατρικών Σπουδών', 'Ισπανικής Γλώσσας και Φιλολογίας', 'Ιστορίας και Αρχαιολογίας', 'Ιταλικής Γλώσσας και Φιλολογίας', 'Μουσικών Σπουδών', 'Ρωσικής Γλώσσας και Φιλολογίας και Σλαβικών Σπουδών', 'Φιλολογίας', 'Φιλοσοφίας', 'Ψυχολογίας'],
    'Επιστημών Υγείας': ['Ιατρικής', 'Νοσηλευτικής', 'Οδοντιατρικής', 'Φαρμακευτικής'],
    'Νομική': ['Νομικής'],
    'Θεολογική': ['Θεολογίας', 'Κοινωνικής Θεολογίας και Θρησκειολογίας'],
    'Οικονομικών και Πολιτικών Επιστημών': ['Διαχείρισης Λιμένων και Ναυτιλίας', 'Επικοινωνίας και Μέσων Μαζικής Ενημέρωσης', 'Οικονομικών Επιστημών', 'Πολιτικής Επιστήμης και Δημόσιας Διοίκησης', 'Τουρκικών Σπουδών και Σύγχρονων Ασιατικών Σπουδών', 'Διοίκησης Επιχειρήσεων και Οργανισμών', 'Κοινωνιολογίας', 'Ψηφιακών Τεχνών και Κινηματογράφου'],
    'Επιστημών Αγωγής': ['Παιδαγωγικό Τμήμα Δημοτικής Εκπαίδευσης', 'Εκπαίδευσης και Αγωγής στην Προσχολική Ηλικία'],
    'Επιστήμης Φυσικής Αγωγής και Αθλητισμού': ['Επιστήμης Φυσικής Αγωγής και Αθλητισμού'],
    '"Αγροτικής Ανάπτυξης': ['Διατροφής και Αειφορίας"', 'Διατροφής και Αειφορίας"']
  },
  'Εθνικό Μετσόβιο Πολυτεχνείο': {
    'Πολιτικών Μηχανικών': ['Πολιτικών Μηχανικών'],
    'Μηχανολόγων Μηχανικών': ['Μηχανολόγων Μηχανικών'],
    'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών': ['Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών'],
    'Αρχιτεκτόνων Μηχανικών': ['Αρχιτεκτόνων Μηχανικών'],
    'Χημικών Μηχανικών': ['Χημικών Μηχανικών'],
    'Αγρονόμων και Τοπογράφων Μηχανικών': ['Αγρονόμων και Τοπογράφων Μηχανικών – Μηχανικών Γεωπληροφορικής'],
    'Μηχανικών Μεταλλείων – Μεταλλουργών': ['Μηχανικών Μεταλλείων – Μεταλλουργών'],
    'Ναυπηγών Μηχανολόγων Μηχανικών': ['Ναυπηγών Μηχανολόγων Μηχανικών'],
    'Εφαρμοσμένων Μαθηματικών και Φυσικών Επιστημών': ['Εφαρμοσμένων Μαθηματικών και Φυσικών Επιστημών']
  },
  'Οικονομικό Πανεπιστήμιο Αθηνών': {
    'Οικονομικών Επιστημών': ['Διεθνών και Ευρωπαϊκών Οικονομικών Σπουδών', 'Οικονομικής Επιστήμης'],
    'Διοίκησης Επιχειρήσεων': ['Διοικητικής Επιστήμης και Τεχνολογίας', 'Οργάνωσης και Διοίκησης Επιχειρήσεων', 'Λογιστικής και Χρηματοοικονομικής', 'Μάρκετινγκ και Επικοινωνίας'],
    'Επιστημών και Τεχνολογίας της Πληροφορίας': ['Πληροφορικής', 'Στατιστικής']
  },
  'Γεωπονικό Πανεπιστήμιο Αθηνών': {
    'Επιστημών των Φυτών': ['Επιστήμης Φυτικής Παραγωγής', 'Δασολογίας και Διαχείρισης Φυσικού Περιβάλλοντος', 'Δασοπονίας και Διαχείρισης Φυσικού Περιβάλλοντος (Καρπενήσι)'],
    'Επιστημών των Ζώων': ['Επιστήμης Ζωικής Παραγωγής'],
    'Περιβάλλοντος και Γεωργικής Μηχανικής': ['Αξιοποίησης Φυσικών Πόρων και Γεωργικής Μηχανικής', 'Πληροφορικής στη Γεωργία και το Περιβάλλον'],
    'Επιστημών Τροφίμων και Διατροφής': ['Επιστήμης Τροφίμων και Διατροφής του Ανθρώπου', 'Διαιτολογίας και Ποιότητας Ζωής'],
    'Εφαρμοσμένης Βιολογίας και Βιοτεχνολογίας': ['Βιοτεχνολογίας'],
    'Εφαρμοσμένων Οικονομικών και Κοινωνικών Επιστημών': ['Αγροτικής Οικονομίας και Ανάπτυξης', 'Περιφερειακής και Οικονομικής Ανάπτυξης', 'Διοίκησης Γεωργικών Επιχειρήσεων και Συστημάτων Εφοδιασμού', 'Πολιτισμού και Αγροτικού Τουρισμού']
  },
  'Πάντειο Πανεπιστήμιο': {
    'Επιστημών Οικονομίας και Δημόσιας Διοίκησης': ['Δημόσιας Διοίκησης', 'Οικονομικής και Περιφερειακής Ανάπτυξης'],
    'Πολιτικών Επιστημών': ['Πολιτικής Επιστήμης και Ιστορίας', 'Κοινωνικής Πολιτικής'],
    'Κοινωνικών Επιστημών': ['Κοινωνιολογίας', 'Ψυχολογίας', 'Κοινωνικής Ανθρωπολογίας'],
    '"Διεθνών Σπουδών': ['Επικοινωνίας και Πολιτισμού"', 'Επικοινωνίας και Πολιτισμού"']
  },
  'Πανεπιστήμιο Δυτικής Αττικής': {
    'Δημόσιας Υγείας': ['Δημόσιας και Κοινοτικής Υγείας', 'Πολιτικών Δημόσιας Υγείας'],
    '"Διοικητικών': ['Οικονομικών και Κοινωνικών Επιστημών"', 'Οικονομικών και Κοινωνικών Επιστημών"', 'Οικονομικών και Κοινωνικών Επιστημών"', 'Οικονομικών και Κοινωνικών Επιστημών"', 'Οικονομικών και Κοινωνικών Επιστημών"', 'Οικονομικών και Κοινωνικών Επιστημών"'],
    'Επιστημών Τροφίμων': ['Επιστήμης και Τεχνολογίας Τροφίμων', '"Επιστημών Οίνου'],
    'Επιστημών Υγείας και Πρόνοιας': ['Βιοϊατρικών Επιστημών', 'Εργοθεραπείας', 'Μαιευτικής', 'Νοσηλευτικής', 'Φυσικοθεραπείας'],
    'Εφαρμοσμένων Τεχνών και Πολιτισμού': ['Γραφιστικής και Οπτικής Επικοινωνίας', 'Εσωτερικής Αρχιτεκτονικής', 'Συντήρησης Αρχαιοτήτων και Έργων Τέχνης', 'Φωτογραφίας και Οπτικοακουστικών Τεχνών'],
    'Πολυτεχνική Σχολή': ['Βιοϊατρικής Μηχανικής', 'Ηλεκτρολόγων και Ηλεκτρονικών Μηχανικών', 'Μηχανικών Πληροφορικής και Υπολογιστών', 'Μηχανικών Τοπογραφίας και Γεωπληροφορικής', 'Μηχανολόγων Μηχανικών', 'Ναυπηγών Μηχανικών', 'Πολιτικών Μηχανικών']
  },
  'Χαροκόπειο Πανεπιστήμιο': {
    '"Περιβάλλοντος': ['Γεωγραφίας και Εφαρμοσμένων Οικονομικών"', 'Γεωγραφίας και Εφαρμοσμένων Οικονομικών"'],
    'Επιστημών Υγείας και Αγωγής': ['Επιστήμης Διαιτολογίας – Διατροφής'],
    'Ψηφιακής Τεχνολογίας': ['Πληροφορικής και Τηλεματικής']
  },
  'Πανεπιστήμιο Πειραιώς': {
    '"Οικονομικών': ['Επιχειρηματικών και Διεθνών Σπουδών"', 'Επιχειρηματικών και Διεθνών Σπουδών"', 'Επιχειρηματικών και Διεθνών Σπουδών"', 'Επιχειρηματικών και Διεθνών Σπουδών"'],
    'Ναυτιλίας και Βιομηχανίας': ['Ναυτιλιακών Σπουδών', 'Βιομηχανικής Διοίκησης και Τεχνολογίας'],
    'Χρηματοοικονομικής και Στατιστικής': ['Χρηματοοικονομικής και Τραπεζικής Διοικητικής', 'Στατιστικής και Ασφαλιστικής Επιστήμης'],
    'Τεχνολογιών Πληροφορικής και Επικοινωνιών': ['Πληροφορικής', 'Ψηφιακών Συστημάτων']
  },
  'Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης': {
    'Θεολογική': ['Θεολογίας', 'Ποιμαντικής και Κοινωνικής Θεολογίας'],
    'Φιλοσοφική': ['Φιλολογίας', 'Ιστορίας και Αρχαιολογίας', 'Φιλοσοφίας και Παιδαγωγικής', 'Ψυχολογίας', 'Αγγλικής Γλώσσας και Φιλολογίας', 'Γαλλικής Γλώσσας και Φιλολογίας', 'Γερμανικής Γλώσσας και Φιλολογίας', 'Ιταλικής Γλώσσας και Φιλολογίας'],
    'Θετικών Επιστημών': ['Μαθηματικών', 'Φυσικής', 'Χημείας', 'Βιολογίας', 'Γεωλογίας', 'Πληροφορικής'],
    'Νομική': ['Νομικής'],
    'Οικονομικών και Πολιτικών Επιστημών': ['Οικονομικών Επιστημών', 'Πολιτικών Επιστημών', 'Δημοσιογραφίας και Μέσων Μαζικής Επικοινωνίας'],
    'Επιστημών Υγείας': ['Ιατρικής', 'Κτηνιατρικής', 'Οδοντιατρικής', 'Φαρμακευτικής'],
    'Πολυτεχνική Σχολή': ['Πολιτικών Μηχανικών', 'Αρχιτεκτόνων Μηχανικών', 'Αγρονόμων και Τοπογράφων Μηχανικών', 'Μηχανολόγων Μηχανικών', 'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Χημικών Μηχανικών', 'Μηχανικών Χωροταξίας και Ανάπτυξης'],
    'Καλών Τεχνών': ['Εικαστικών και Εφαρμοσμένων Τεχνών', 'Μουσικών Σπουδών', 'Θεάτρου', 'Κινηματογράφου'],
    'Παιδαγωγική': ['Δημοτικής Εκπαίδευσης', 'Νηπιαγωγών'],
    'Επιστήμης Φυσικής Αγωγής και Αθλητισμού': ['Επιστήμης Φυσικής Αγωγής και Αθλητισμού (Θεσσαλονίκη)', 'Επιστήμης Φυσικής Αγωγής και Αθλητισμού (Σέρρες)'],
    '"Γεωπονίας': ['Δασολογίας και Φυσικού Περιβάλλοντος"', 'Δασολογίας και Φυσικού Περιβάλλοντος"']
  },
  'Πανεπιστήμιο Μακεδονίας': {
    'Οικονομικών και Περιφερειακών Σπουδών': ['Οικονομικών Επιστημών', '"Βαλκανικών'],
    'Επιστημών Διοίκησης Επιχειρήσεων': ['Οργάνωσης και Διοίκησης Επιχειρήσεων', 'Λογιστικής και Χρηματοοικονομικής'],
    'Επιστημών Πληροφορίας': ['Εφαρμοσμένης Πληροφορικής'],
    '"Κοινωνικών': ['Ανθρωπιστικών Επιστημών και Τεχνών"', 'Ανθρωπιστικών Επιστημών και Τεχνών"', 'Ανθρωπιστικών Επιστημών και Τεχνών"']
  },
  'Πανεπιστήμιο Δυτικής Μακεδονίας': {
    'Πολυτεχνική Σχολή': ['Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Μηχανικών Ορυκτών Πόρων', 'Μηχανικών Σχεδίασης Προϊόντων και Συστημάτων', 'Μηχανολόγων Μηχανικών', 'Χημικών Μηχανικών'],
    'Σχολή Οικονομικών Επιστημών': ['Διεθνών και Ευρωπαϊκών Οικονομικών Σπουδών', 'Διοικητικής Επιστήμης και Τεχνολογίας', 'Λογιστικής και Χρηματοοικονομικής', 'Οικονομικών Επιστημών', 'Οργάνωσης και Διοίκησης Επιχειρήσεων', 'Περιφερειακής και Διασυνοριακής Ανάπτυξης', 'Στατιστικής'],
    'Σχολή Καλών Τεχνών': ['Εικαστικών και Εφαρμοσμένων Τεχνών'],
    'Σχολή Γεωπονικών Επιστημών': ['Γεωπονίας'],
    'Σχολή Κοινωνικών και Ανθρωπιστικών Επιστημών': ['Παιδαγωγικό Δημοτικής Εκπαίδευσης', 'Παιδαγωγικό Νηπιαγωγών', 'Ψυχολογίας', 'Επικοινωνίας και Ψηφιακών Μέσων'],
    'Σχολή Επιστημών Υγείας': ['Εργοθεραπείας', 'Μαιευτικής'],
    'Σχολή Θετικών Επιστημών': ['Μαθηματικών', 'Πληροφορικής']
  },
  'Διεθνές Πανεπιστήμιο της Ελλάδος': {
    'Οικονομίας και Διοίκησης': ['Οργάνωσης και Διοίκησης Επιχειρήσεων', 'Οικονομικών Επιστημών', 'Διοίκησης Εφοδιαστικής Αλυσίδας', 'Λογιστικής και Χρηματοοικονομικής', '"Διοίκησης Οργανισμών', 'Λογιστικής και Πληροφοριακών Συστημάτων', 'Διοικητικής Επιστήμης και Τεχνολογίας', 'Δημόσιας Διοίκησης'],
    'Κοινωνικών Επιστημών': ['"Βιβλιοθηκονομίας', 'Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία', 'Ανατολικών Γλωσσών'],
    'Επιστημών Υγείας': ['Μαιευτικής', 'Βιοϊατρικών Επιστημών', 'Φυσικοθεραπείας', 'Νοσηλευτικής'],
    'Μηχανικών': ['Μηχανολόγων Μηχανικών', 'Μηχανικών Τοπογραφίας και Γεωπληροφορικής', 'Πολιτικών Μηχανικών', '"Μηχανικών Πληροφορικής', 'Μηχανικών Περιβάλλοντος', 'Μηχανικών Παραγωγής και Διοίκησης', 'Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων'],
    'Επιστημών Σχεδιασμού': ['Εσωτερικής Αρχιτεκτονικής', 'Δημιουργικού Σχεδιασμού και Ένδυσης'],
    'Θετικών Επιστημών': ['Φυσικής', 'Χημείας', 'Πληροφορικής', 'Γεωλογίας'],
    'Γεωτεχνικών Επιστημών': ['Γεωπονίας', 'Επιστήμης και Τεχνολογίας Τροφίμων'],
    '"Ανθρωπιστικών': ['Κοινωνικών και Οικονομικών Σπουδών (ΠΚΔΠΣ)"'],
    'Επιστήμης και Τεχνολογίας (ΠΚΔΠΣ)': ['Αγγλόφωνα προγράμματα Science & Technology']
  },
  'Δημοκρίτειο Πανεπιστήμιο Θράκης': {
    'Νομική': ['Νομικής'],
    '"Επιστήμης Φυσικής Αγωγής': ['Αθλητισμού και Εργοθεραπείας"', 'Αθλητισμού και Εργοθεραπείας"'],
    'Ανθρωπιστικών Επιστημών': ['Ανθρωπιστικών Σπουδών'],
    '"Κοινωνικών': ['Πολιτικών και Οικονομικών Επιστημών"', 'Πολιτικών και Οικονομικών Επιστημών"', 'Πολιτικών και Οικονομικών Επιστημών"', 'Πολιτικών και Οικονομικών Επιστημών"'],
    'Επιστημών Υγείας': ['Ιατρικής', 'Νοσηλευτικής'],
    'Επιστημών Αγωγής': ['Επιστημών της Εκπαίδευσης στην Προσχολική Ηλικία', 'Ψυχολογίας', 'Παιδαγωγικό Δημοτικής Εκπαίδευσης'],
    'Επιστημών Γεωπονίας και Δασολογίας': ['Αγροτικής Ανάπτυξης', 'Δασολογίας και Διαχείρισης Περιβάλλοντος και Φυσικών Πόρων', 'Αμπελουργίας και Οινολογίας (Δράμα)', 'Δασολογίας και Φυσικού Περιβάλλοντος (Δράμα)'],
    'Πολυτεχνική Σχολή': ['Αρχιτεκτόνων Μηχανικών', 'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Πολιτικών Μηχανικών', 'Μηχανικών Περιβάλλοντος', 'Μηχανικών Παραγωγής και Διοίκησης'],
    'Διοικητικής Επιστήμης και Λογιστικής': ['Διοικητικής Επιστήμης και Τεχνολογίας'],
    'Σχολή Θετικών Επιστημών': ['Πληροφορικής', 'Φυσικής', 'Χημείας']
  },
  'Πανεπιστήμιο Ιωαννίνων': {
    'Φιλοσοφική': ['Φιλολογίας', 'Ιστορίας και Αρχαιολογίας', 'Φιλοσοφίας'],
    'Θετικών Επιστημών': ['Μαθηματικών', 'Φυσικής', 'Χημείας'],
    'Επιστημών Υγείας': ['Ιατρικής', 'Βιολογικών Εφαρμογών και Τεχνολογιών', 'Νοσηλευτικής', 'Λογοθεραπείας'],
    'Επιστημών Αγωγής': ['Παιδαγωγικό Δημοτικής Εκπαίδευσης', 'Παιδαγωγικό Νηπιαγωγών'],
    'Οικονομικών και Διοικητικών Επιστημών': ['Οικονομικών Επιστημών', 'Λογιστικής και Χρηματοοικονομικής'],
    'Κοινωνικών Επιστημών': ['Ψυχολογίας', 'Αγωγής και Φροντίδας στην Πρώιμη Παιδική Ηλικία', 'Μετάφρασης & Διερμηνείας'],
    'Καλών Τεχνών': ['Εικαστικών Τεχνών και Επιστημών της Τέχνης'],
    'Μουσικών Σπουδών': ['Μουσικών Σπουδών'],
    'Γεωπονίας': ['Γεωπονίας'],
    'Πληροφορικής και Τηλεπικοινωνιών': ['Πληροφορικής και Τηλεπικοινωνιών'],
    'Πολυτεχνική Σχολή': ['Μηχανικών Επιστήμης Υλικών', 'Μηχανικών Η/Υ και Πληροφορικής', 'Αρχιτεκτόνων Μηχανικών']
  },
  'Πανεπιστήμιο Θεσσαλίας': {
    'Πολυτεχνική Σχολή': ['Αρχιτεκτόνων Μηχανικών', 'Πολιτικών Μηχανικών', 'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Μηχανολόγων Μηχανικών', '"Μηχανικών Χωροταξίας'],
    'Ανθρωπιστικών και Κοινωνικών Επιστημών': ['"Πολιτισμού', 'Παιδαγωγικό Προσχολικής Εκπαίδευσης', '"Ιστορίας', 'Γλωσσικών και Διαπολιτισμικών Σπουδών', 'Ειδικής Αγωγής', 'Παιδαγωγικό Δημοτικής Εκπαίδευσης'],
    '"Επιστημών Φυσικής Αγωγής': ['Αθλητισμού και Διαιτολογίας"', 'Αθλητισμού και Διαιτολογίας"'],
    'Επιστημών Υγείας': ['Βιοχημείας και Βιοτεχνολογίας', 'Νοσηλευτικής', 'Φυσικοθεραπείας', 'Δημόσιας και Ενιαίας Υγείας', 'Ιατρικής', 'Κτηνιατρικής'],
    'Οικονομικών και Διοικητικών Επιστημών': ['Λογιστικής και Χρηματοοικονομικής', 'Διοίκησης Επιχειρήσεων', 'Οικονομικών Επιστημών'],
    'Τεχνολογίας': ['Ενεργειακών Συστημάτων', 'Περιβαλλοντικών Επιστημών', '"Δασολογίας', 'Ψηφιακών Συστημάτων'],
    'Γεωπονικών Επιστημών': ['Γεωπονίας Φυτικής Παραγωγής και Αγροτικού Περιβάλλοντος', 'Γεωπονίας Ιχθυολογίας και Υδάτινου Περιβάλλοντος', 'Γεωπονίας – Αγροτεχνολογίας', 'Επιστήμης Ζωικής Παραγωγής', 'Επιστήμης Τροφίμων και Διατροφής'],
    'Θετικών Επιστημών': ['Επιστήμης Υπολογιστών και Βιοϊατρικής Πληροφορικής', 'Πληροφορικής και Τηλεπικοινωνιών', 'Μαθηματικών', 'Φυσικής']
  },
  'Πανεπιστήμιο Πελοποννήσου': {
    'Οικονομίας και Τεχνολογίας': ['Διοικητικής Επιστήμης και Τεχνολογίας', 'Ψηφιακών Συστημάτων', 'Πληροφορικής και Τηλεπικοινωνιών', 'Οικονομικών Επιστημών'],
    'Ανθρωπιστικών Επιστημών και Πολιτισμικών Σπουδών': ['Φιλολογίας', '"Ιστορίας'],
    'Κοινωνικών και Πολιτικών Επιστημών': ['Κοινωνικής και Εκπαιδευτικής Πολιτικής', 'Πολιτικής Επιστήμης και Διεθνών Σχέσεων'],
    'Καλών Τεχνών': ['Θεατρικών Σπουδών', 'Ψηφιακών και Παραστατικών Τεχνών'],
    'Επιστημών Ανθρώπινης Κίνησης και Ποιότητας Ζωής': ['Οργάνωσης και Διαχείρισης Αθλητισμού'],
    'Γεωπονίας και Τροφίμων': ['Γεωπονίας', 'Επιστήμης και Τεχνολογίας Τροφίμων'],
    'Διοίκησης': ['Διοίκησης Επιχειρήσεων και Οργανισμών', 'Λογιστικής και Χρηματοοικονομικής'],
    'Επιστημών Υγείας': ['Επιστήμης Διατροφής και Διαιτολογίας', 'Φυσικοθεραπείας', 'Νοσηλευτικής', 'Λογοθεραπείας'],
    'Μηχανικών': ['Πολιτικών Μηχανικών'],
    'Πολυτεχνική Σχολή': ['Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Μηχανολόγων Μηχανικών']
  },
  'Πανεπιστήμιο Πατρών': {
    'Θετικών Επιστημών': ['Βιολογίας', 'Γεωλογίας', 'Μαθηματικών', 'Φυσικής', 'Χημείας', 'Επιστήμης των Υλικών'],
    'Πολυτεχνική Σχολή': ['Ηλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών', 'Μηχανολόγων και Αεροναυπηγών Μηχανικών', 'Μηχανικών Η/Υ και Πληροφορικής', 'Χημικών Μηχανικών', 'Πολιτικών Μηχανικών', 'Αρχιτεκτόνων Μηχανικών'],
    'Επιστημών Υγείας': ['Ιατρικής', 'Φαρμακευτικής'],
    'Ανθρωπιστικών και Κοινωνικών Επιστημών': ['Επιστημών της Εκπαίδευσης και Κοινωνικής Εργασίας', 'Επιστημών της Εκπαίδευσης και της Αγωγής στην Προσχολική Ηλικία', 'Θεατρικών Σπουδών', 'Ιστορίας-Αρχαιολογίας', 'Φιλολογίας', 'Φιλοσοφίας'],
    'Οικονομικών Επιστημών και Διοίκησης Επιχειρήσεων': ['Οικονομικών Επιστημών', 'Διοίκησης Επιχειρήσεων', 'Διοικητικής Επιστήμης και Τεχνολογίας', 'Διοίκησης Τουρισμού'],
    'Γεωπονικών Επιστημών': ['Επιστήμης Βιοσυστημάτων και Γεωργικής Μηχανικής', 'Επιστήμης και Τεχνολογίας Τροφίμων', 'Επιστήμης Φυτικής Παραγωγής', '"Ζωικής Παραγωγής'],
    'Επιστημών Αποκατάστασης Υγείας': ['Νοσηλευτικής', 'Φυσικοθεραπείας', 'Λογοθεραπείας', 'Επιστήμης Φυσικής Αγωγής και Αθλητισμού']
  },
  'Πανεπιστήμιο Αιγαίου': {
    'Ανθρωπιστικών Επιστημών': ['Παιδαγωγικό Δημοτικής Εκπαίδευσης', 'Επιστημών της Προσχολικής Αγωγής και του Εκπαιδευτικού Σχεδιασμού', 'Μεσογειακών Σπουδών'],
    'Επιστημών της Διοίκησης': ['Διοίκησης Επιχειρήσεων', 'Ναυτιλίας και Επιχειρηματικών Υπηρεσιών', 'Οικονομικής και Διοίκησης Τουρισμού'],
    'Θετικών Επιστημών': ['Μαθηματικών', 'Στατιστικής και Αναλογιστικών – Χρηματοοικονομικών Μαθηματικών'],
    'Κοινωνικών Επιστημών': ['Κοινωνικής Ανθρωπολογίας και Ιστορίας', 'Κοινωνιολογίας', 'Γεωγραφίας', 'Πολιτισμικής Τεχνολογίας και Επικοινωνίας'],
    'Περιβάλλοντος': ['Περιβάλλοντος', 'Επιστήμης Τροφίμων και Διατροφής', 'Ωκεανογραφίας και Θαλασσίων Βιοεπιστημών'],
    'Πολυτεχνική Σχολή': ['Μηχανικών Οικονομίας και Διοίκησης', 'Μηχανικών Πληροφοριακών και Επικοινωνιακών Συστημάτων', 'Μηχανικών Σχεδίασης Προϊόντων και Συστημάτων']
  },
  'Ιόνιο Πανεπιστήμιο': {
    'Ανθρωπιστικών Επιστημών': ['Ιστορίας και Ψηφιακών Ανθρωπιστικών Επιστημών', '"Ξένων Γλωσσών'],
    'Επιστήμης της Πληροφορίας & Πληροφορικής': ['"Αρχειονομίας', 'Πληροφορικής', 'Ψηφιακών Μέσων και Επικοινωνίας'],
    'Μουσικής & Οπτικοακουστικών Τεχνών': ['Τεχνών Ήχου και Εικόνας', 'Μουσικών Σπουδών', 'Εθνομουσικολογίας'],
    'Περιβάλλοντος': ['Περιβάλλοντος', 'Επιστήμης και Τεχνολογίας Τροφίμων'],
    'Οικονομικών Επιστημών': ['Περιφερειακής Ανάπτυξης', 'Τουρισμού']
  },
  'Πανεπιστήμιο Κρήτης': {
    'Φιλοσοφική': ['Φιλολογίας', 'Ιστορίας και Αρχαιολογίας', 'Φιλοσοφίας'],
    'Κοινωνικών Επιστημών': ['Κοινωνιολογίας', 'Οικονομικών Επιστημών', 'Πολιτικής Επιστήμης', 'Ψυχολογίας'],
    'Επιστημών Αγωγής': ['Παιδαγωγικό Δημοτικής Εκπαίδευσης', 'Παιδαγωγικό Προσχολικής Εκπαίδευσης'],
    'Θετικών και Τεχνολογικών Επιστημών': ['Φυσικής', 'Χημείας', 'Βιολογίας', 'Μαθηματικών και Εφαρμοσμένων Μαθηματικών', 'Επιστήμης Υπολογιστών', 'Επιστήμης και Μηχανικής Υλικών'],
    'Επιστημών Υγείας': ['Ιατρικής']
  },
  'Πολυτεχνείο Κρήτης': {
    'Μηχανικών Παραγωγής και Διοίκησης': ['Μηχανικών Παραγωγής και Διοίκησης'],
    'Μηχανικών Ορυκτών Πόρων': ['Μηχανικών Ορυκτών Πόρων'],
    'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών': ['Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών'],
    'Χημικών Μηχανικών και Μηχανικών Περιβάλλοντος': ['Χημικών Μηχανικών και Μηχανικών Περιβάλλοντος'],
    'Αρχιτεκτόνων Μηχανικών': ['Αρχιτεκτόνων Μηχανικών']
  },
  'Ελληνικό Μεσογειακό Πανεπιστήμιο': {
    'Πολυτεχνική Σχολή': ['Ηλεκτρονικών Μηχανικών', 'Μηχανικών Φυσικών Πόρων και Περιβάλλοντος', 'Μηχανολόγων Μηχανικών', 'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών', 'Πολιτικών Μηχανικών'],
    'Επιστημών Διοίκησης και Οικονομίας': ['Διοίκησης Επιχειρήσεων και Τουρισμού', 'Διοικητικής Επιστήμης και Τεχνολογίας', 'Λογιστικής και Χρηματοοικονομικής'],
    'Μουσικής και Οπτικοακουστικών Τεχνολογιών': ['Μηχανικών Μουσικής Τεχνολογίας και Ακουστικής'],
    'Επιστημών Υγείας': ['Νοσηλευτικής', 'Κοινωνικής Εργασίας', 'Επιστημών Διατροφής και Διαιτολογίας'],
    'Γεωπονικών Επιστημών': ['Γεωπονίας']
  },
  'Ελληνικό Ανοικτό Πανεπιστήμιο': {
    'Ανθρωπιστικών Επιστημών': ['Σπουδές στον Ελληνικό Πολιτισμό', 'Σπουδές στον Ευρωπαϊκό Πολιτισμό'],
    'Κοινωνικών Επιστημών': ['Διοίκηση Επιχειρήσεων και Οργανισμών', 'Σπουδές στις Φυσικές Επιστήμες (συναφή προγράμματα)'],
    'Θετικών Επιστημών και Τεχνολογίας': ['Σπουδές στην Πληροφορική', 'Διαχείριση Τεχνικών Έργων'],
    'Εφαρμοσμένων Τεχνών και Βιώσιμου Σχεδιασμού': ['"Σπουδές Κινηματογραφικής Γραφής']
  },
  'Ανώτατη Σχολή Καλών Τεχνών': {
    '(μονοτμηματικό ίδρυμα)': ['Εικαστικών Τεχνών', 'Θεωρίας και Ιστορίας της Τέχνης']
  },
  'Ανώτατη Σχολή Παιδαγωγικής και Τεχνολογικής Εκπαίδευσης': {
    '(μονοτμηματικό ίδρυμα)': ['Παιδαγωγικό Τμήμα', 'Εκπαιδευτικών Ηλεκτρολόγων Μηχανικών και Εκπαιδευτικών Ηλεκτρονικών Μηχανικών', 'Εκπαιδευτικών Μηχανολόγων Μηχανικών', 'Εκπαιδευτικών Πολιτικών Μηχανικών']
  },
  'Ανώτερη Σχολή Τουριστικής Εκπαίδευσης': {
    'ΑΣΤΕΡ – Ρόδος': ['Πρόγραμμα Σπουδών ΑΣΤΕΡ'],
    '"ΑΣΤΕΚ – Άγιος Νικόλαος': ['Κρήτη"']
  },
  'Ανώτατη Εκκλησιαστική Ακαδημία': {
    'Ανώτατη Εκκλησιαστική Ακαδημία Αθήνας': ['Πρόγραμμα Ιερατικών Σπουδών', 'Πρόγραμμα Διαχείρισης Εκκλησιαστικών Κειμηλίων'],
    'Πατριαρχική Ανώτατη Εκκλησιαστική Ακαδημία Κρήτης': ['Πρόγραμμα Ιερατικών Σπουδών', 'Πρόγραμμα Διαχείρισης Εκκλησιαστικών Κειμηλίων']
  },
  'Μεσογειακό Αγρονομικό Ινστιτούτο Χανίων': {
    '(ινστιτούτο CIHEAM – μόνο μεταπτυχιακά)': ['Business Economics and Management', 'Food Quality and Chemistry of Natural Products', 'Geoinformation in Environmental Management', 'Horticultural Genetics and Biotechnology', 'Sustainable Agriculture']
  },
  'Στρατιωτικές Σχολές': {
    'Ανώτατα Στρατιωτικά Εκπαιδευτικά Ιδρύματα (ΑΣΕΙ)': ['Στρατιωτική Σχολή Ευελπίδων (ΣΣΕ)', 'Σχολή Ναυτικών Δοκίμων (ΣΝΔ)', 'Σχολή Ικάρων (ΣΙ)'],
    'Λοιπά ΑΕΙ Ενόπλων Δυνάμεων': ['Στρατιωτική Σχολή Αξιωματικών Σωμάτων (ΣΣΑΣ)', 'Σχολή Αξιωματικών Νοσηλευτικής (ΣΑΝ)'],
    'Ανώτερες/Ανώτατες Σχολές Υπαξιωματικών (ΑΣΣΥ)': ['Σχολή Μονίμων Υπαξιωματικών (ΣΜΥ)', 'Σχολή Μονίμων Υπαξιωματικών Ναυτικού (ΣΜΥΝ)', 'Σχολή Μονίμων Υπαξιωματικών Αεροπορίας (ΣΜΥΑ)']
  },
  'Σχολές Σωμάτων Ασφαλείας': {
    'Ελληνική Αστυνομία': ['Σχολή Αξιωματικών Ελληνικής Αστυνομίας', 'Σχολή Αστυφυλάκων'],
    'Πυροσβεστική Ακαδημία': ['Σχολή Αξιωματικών Πυροσβεστικής Ακαδημίας', 'Σχολή Πυροσβεστών'],
    'Λιμενικό Σώμα – Ελληνική Ακτοφυλακή': ['Σχολή Δοκίμων Σημαιοφόρων Λ.Σ.-ΕΛ.ΑΚΤ.', 'Σχολή Δοκίμων Λιμενοφυλάκων']
  }
};
